[
  {
    "slug": "slaget-vid-jutas",
    "pages": [
      {
        "layout": "1",
        "panels": [
          {
            "id": "1.1.1",
            "narration": "In 1808, war broke out between Sweden and Russia. The struggle for Finland had begun. Villages burned, armies marched through snow and forest. What was once Swedish Finland stood alone against the Empire of the Tsar. This is the story of courage and defiance — at Jutas."
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "2.1.1",
            "narration": "September 13, 1808. The small village of Jutas near Nykarleby becomes the stage for a decisive encounter."
          },
          {
            "id": "2.1.2",
            "narration": "Swedish-Finnish forces, under Colonel Cronstedt, await the Russians advancing from the south."
          },
          {
            "id": "2.1.3"
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "3.1.1",
            "narration": "In a modest house in Nykarleby, the commander lies ill but unyielding."
          },
          {
            "id": "3.1.2",
            "narration": "Major General Georg Carl von Döbeln — feverish, wounded, yet commanding."
          },
          {
            "id": "3.1.3"
          },
          {
            "id": "3.1.4"
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "4.1.1",
            "narration": "Jutas — a quiet settlement, soon to echo with musket fire."
          },
          {
            "id": "4.1.2",
            "narration": "Cronstedt’s men secure their ground, while Döbeln’s detachment moves to outflank."
          },
          {
            "id": "4.1.3",
            "narration": "The enemy had twice their number."
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "5.1.1",
            "narration": "At noon, the first volleys burst. The air thick with powder."
          },
          {
            "id": "5.1.2"
          },
          {
            "id": "5.1.3",
            "narration": "They met the Russians head-on — steel against steel."
          },
          {
            "id": "5.1.4"
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "6.1.1",
            "narration": "The Russian left flank falters. Döbeln sees the moment."
          },
          {
            "id": "6.1.2"
          },
          {
            "id": "6.1.3",
            "narration": "By dusk, Jutas was theirs. The victory saved the army’s retreat toward Vasa."
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "7.1.1",
            "narration": "Night fell over Jutas. The victory was costly."
          },
          {
            "id": "7.1.2",
            "narration": "The sick general had led one of the last Swedish victories of the war."
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "8.1.1",
            "narration": "Over two centuries later — the story lives on."
          },
          {
            "id": "8.1.2"
          },
          {
            "id": "8.1.3",
            "narration": "‘Det var en gång en hjälte, och han hette Döbeln vid Jutas.’"
          }
        ]
      }
    ]
  },
  {
    "slug": "slaget-vid-jutas-2",
    "pages": [
      {
        "layout": "1",
        "panels": [
          {
            "id": "1.1.1",
            "narration": "In 1808, war reached the Finnish provinces. Sweden and the Russian Empire clashed over control of Finland, marking the beginning of a decisive campaign that would reshape the North."
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "2.1.1",
            "narration": "September 1808. Near Nykarleby, two armies prepare to meet at Jutas — Sweden’s last hope of halting the Russian advance."
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "3.1.1",
            "narration": "Retreat from Vasa — tired boots, steady resolve."
          },
          {
            "id": "3.1.2",
            "narration": "Toward Nykarleby — night draws near, but duty drives them on."
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "4.1.1",
            "narration": "Wounded and feverish, Döbeln refuses rest — the battle must still be commanded."
          },
          {
            "id": "4.1.2",
            "narration": "Messages from the front — every word from Döbeln carries the weight of command."
          },
          {
            "id": "4.1.3",
            "narration": "‘We march at dawn… Jutas will be our stand.’"
          },
          {
            "id": "4.1.4",
            "narration": "Through fever and night, command rides onward."
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "5.1.1",
            "narration": "The march to Jutas begins — discipline over weakness, purpose over pain."
          },
          {
            "id": "5.1.2",
            "narration": "Courage stirs along the line — Jutas lies ahead."
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "6.1.1",
            "narration": "The battle begins — the Russians strike first."
          },
          {
            "id": "6.1.2",
            "narration": "Step by step, the Swedes yield ground — not disorder, but discipline."
          },
          {
            "id": "6.1.3",
            "narration": "Amid smoke and thunder, leadership steels the wavering line."
          },
          {
            "id": "6.1.4",
            "narration": "The first clash fades — the field now belongs to Jutas."
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "7.1.1",
            "narration": "Wave after wave, the Russian advance presses on."
          },
          {
            "id": "7.1.2",
            "narration": "The air thickens with smoke and iron — the struggle for Jutas tightens."
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "8.1.1",
            "narration": "At Döbeln’s command, the field erupts in thunder."
          },
          {
            "id": "8.1.2",
            "narration": "Cannon and musket — a single, deafening heartbeat of defiance."
          },
          {
            "id": "8.1.3",
            "narration": "In the chaos, order — the Swedish line holds firm."
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "9.1.1",
            "narration": "Neither side yields — fire answers fire."
          },
          {
            "id": "9.1.2",
            "narration": "Every man a cog in the thunder — precision amid chaos."
          },
          {
            "id": "9.1.3",
            "narration": "The Russians press on, seeking the weak points through smoke and blood."
          },
          {
            "id": "9.1.4",
            "narration": "Where courage falters, Döbeln’s presence reignites the line."
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "10.1.1",
            "narration": "With renewed fury, the Swedes push forward — courage turned to motion."
          },
          {
            "id": "10.1.2",
            "narration": "The tide turns — momentum now in Swedish hands."
          },
          {
            "id": "10.1.3",
            "narration": "Retreat turns to rout — the enemy breaks before the Swedish advance."
          },
          {
            "id": "10.1.4",
            "narration": "Amid triumph’s glare, Döbeln measures the price of victory."
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "11.1.1",
            "narration": "Silence returns — the cost of courage lies in the grass."
          },
          {
            "id": "11.1.2",
            "narration": "The field is theirs — but so is the sorrow."
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "12.1.1",
            "narration": "More than two centuries later, Jutas still speaks — of resolve, of sacrifice, of Finland’s turning point."
          }
        ]
      }
    ]
  }
]