[
  {
    "slug": "slaget-vid-jutas",
    "pages": [
      {
        "layout": "1",
        "panels": [
          {
            "id": "1.1.1",
            "description": {
              "en": "Full-page historical map of Finland during the 1808 war, drawn in clean anime-style lines and based on the attached reference."
            },
            "narration": {
              "en": "In early September 1808, the lands of Finland, Sweden, and Russia stand poised for conflict as armies maneuver across the countryside."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "2.1.1",
            "description": {
              "en": "Portrait-style confrontation of Georg Carl von Döbeln and Russian commander Nikolaj Kamenskij, with the two armies forming distant background masses."
            },
            "narration": {
              "en": "In the foreground, Döbeln and the Russian commander face one another — stern, composed, and inches apart — as columns of Swedish and Russian troops stretch away into the landscape behind them, lowered muskets and distant banners marking each force."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "3.1.1",
            "description": {
              "en": "Panoramic late-summer view of Nykarleby with river bend, church steeple, wooden houses, and a distant small marching Swedish column."
            },
            "narration": {
              "en": "Nykarleby lies quiet under late-summer light as a distant Swedish column approaches along the river road, townsfolk moving about the quays beneath the wide northern sky."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "4.1.1",
            "description": {
              "en": "A weary Swedish column marches through muddy late-summer roads with wagons trailing and distant smoke drifting on the horizon."
            },
            "narration": {
              "en": "Through mud and fading summer light, the Swedish column trudges onward from Vasa—wagons creaking as smoke rises far ahead."
            },
            "dialogs": []
          },
          {
            "id": "4.1.2",
            "description": {
              "en": "Döbeln rides beside weary Swedish soldiers marching through muddy autumn fields as light rain falls."
            },
            "narration": {
              "en": "Along the sodden road, Döbeln rides at the column’s flank while his officers confer amid the spitting rain."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "5.1.1",
            "description": {
              "en": "Evening exterior of a modest wooden house in Nykarleby, with a warm candle-glow shining from one window."
            },
            "narration": {
              "en": "Evening settles over Nykarleby as a faint candlelight glimmers from the house where Döbeln lies sick within."
            },
            "dialogs": []
          },
          {
            "id": "5.1.2",
            "description": {
              "en": "Aide-de-camp arranging maps and dispatches on a wooden table lit by warm candlelight."
            },
            "narration": {
              "en": "In the dim quarters, the aide spreads maps and dispatches as candlelight pools across inked notes."
            },
            "dialogs": []
          },
          {
            "id": "5.1.3",
            "description": {
              "en": "Döbeln sits half-upright in his sickbed, gesturing firmly toward an aide who stands beside a table in the dim candlelit room."
            },
            "narration": {
              "en": "Though weakened by fever and wounds, Döbeln commands from his bed with unwavering resolve."
            },
            "dialogs": []
          },
          {
            "id": "5.1.4",
            "description": {
              "en": "Döbeln, pale and bandaged, points at a map in candlelit quarters while lying in bed."
            },
            "narration": {
              "en": "Despite fever and wounds, Döbeln traces the route to Jutas, issuing orders from his dimly lit quarters."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Here... toward Jutas. They must move at once.",
                  "person": "Georg Carl von Döbeln"
                }
              },
              {
                "en": {
                  "text": "I will have the dispatch sent immediately, sir.",
                  "person": "Aide-de-camp"
                }
              }
            ]
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "6.1.1",
            "description": {
              "en": "Wide establishing view of the Jutas landscape with the river and road under clear late-summer daylight, based on the reference image without its bottom border or text."
            },
            "narration": {
              "en": "The river winds through the quiet fields toward Jutas as the afternoon light settles over the road ahead."
            },
            "dialogs": []
          },
          {
            "id": "6.1.2",
            "description": {
              "en": "Döbeln salutes from horseback before cheering Swedish infantry in the afternoon light near Jutas."
            },
            "narration": {
              "en": "Afternoon light washes over the marching column as Döbeln lifts his hand in salute. The ranks of Björneborgs regemente answer with cheers, their bayonets catching the sun while nearby officers point toward the ground where the defenses will soon be formed."
            }
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "7.1.1",
            "description": {
              "en": "Swedish skirmishers fire from a fence line as thin white musket smoke drifts across the field."
            },
            "narration": {
              "en": "From the fence line, the Swedish skirmishers unleash the first shots of the battle, white smoke curling into the afternoon air."
            },
            "dialogs": []
          },
          {
            "id": "7.1.2",
            "description": {
              "en": "Swedish skirmishers fall back in pairs along a smoke-covered road after receiving the signal to withdraw."
            },
            "narration": {
              "en": "At the signal, the skirmishers peel away from the fence line, retreating in pairs down the winding Jutas road through drifting white smoke."
            },
            "dialogs": []
          },
          {
            "id": "7.1.3",
            "description": {
              "en": "Russian infantry vanguard pushes forward through gaps in the fence line with bayonets held low amid drifting smoke."
            },
            "narration": {
              "en": "Through the broken fence line, the Russian vanguard surges ahead, bayonets lowered as smoke rolls across the field."
            },
            "dialogs": []
          },
          {
            "id": "7.1.4",
            "description": {
              "en": "Von Döbeln is seen at a distance through drifting smoke, raising his hand to steady the Swedish line."
            },
            "narration": {
              "en": "Through the rolling smoke, von Döbeln appears astride his horse, his raised hand holding the line firm amid the growing din of battle."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "8.1.1",
            "description": {
              "en": "Wide view of dense Russian infantry ranks advancing through drifting smoke and splintered fencing."
            },
            "narration": {
              "en": "Through thick drifting smoke, the Russian ranks push forward in a solid wall of bayonets and dark green coats."
            },
            "dialogs": []
          },
          {
            "id": "8.1.2",
            "description": {
              "en": "Swedish defenders crouch behind a low ridge as musket impacts spatter earth around them through drifting smoke."
            },
            "narration": {
              "en": "Behind the low earthen ridge, the Swedish line braces as musket shots punch the soil in bursts of flying dirt."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "9.1.1",
            "description": {
              "en": "Döbeln raises his sword from horseback to signal the attack, aides beside him relaying the command through drifting battlefield smoke."
            },
            "narration": {
              "en": "From the saddle, Döbeln lifts his sword high, and his aides rush to carry the order down the line."
            },
            "dialogs": []
          },
          {
            "id": "9.1.2",
            "description": {
              "en": "Swedish artillery battery fires in unison, cannons recoiling as bright muzzle flames erupt through drifting smoke."
            },
            "narration": {
              "en": "The Swedish guns thunder together, flame and smoke blasting forward as the battery heaves back from the recoil."
            },
            "dialogs": []
          },
          {
            "id": "9.1.3",
            "description": {
              "en": "Swedish infantry fires a coordinated volley, a bright line of muzzle flashes casting a rolling wall of smoke forward."
            },
            "narration": {
              "en": "The infantry unleashes a unified volley, fire and smoke surging outward in a single thunderous blast."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "10.1.1",
            "description": {
              "en": "Russian infantry returns fire in a dense line as officers gesture for the formation to widen through drifting battlefield smoke."
            },
            "narration": {
              "en": "The Russian line answers with its own volley, officers signaling for the frontage to spread as smoke rolls across the field."
            },
            "dialogs": []
          },
          {
            "id": "10.1.2",
            "description": {
              "en": "Swedish infantry hastily reload behind thick smoke, ramrods flashing as they prepare their next volley."
            },
            "narration": {
              "en": "Behind the rolling smoke, the Swedes force their ramrods down the barrels, racing to ready another shot."
            },
            "dialogs": []
          },
          {
            "id": "10.1.3",
            "description": {
              "en": "Wounded soldiers lie between the lines as stretcher men crouch low through drifting smoke."
            },
            "narration": {
              "en": "Between the firing lines, stretcher men creep forward through the smoke to reach the fallen."
            },
            "dialogs": []
          },
          {
            "id": "10.1.4",
            "description": {
              "en": "Swedish artillery crew swabs and rams the cannon as sparks flicker from the vent amid drifting smoke."
            },
            "narration": {
              "en": "The gun crew works in practiced rhythm—swabbing, ramming, and priming the vent as sparks scatter through the smoke."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "11.1.1",
            "description": {
              "en": "Döbeln rallies the Swedish line from horseback, sword raised, as infantry and riders advance through glowing battlefield smoke."
            },
            "narration": {
              "en": "Late-afternoon light cuts through drifting smoke as von Döbeln rides the front line, rallying his men to push forward."
            },
            "dialogs": []
          },
          {
            "id": "11.1.2",
            "description": {
              "en": "Swedish infantry charge forward with bayonets leveled through golden smoke."
            },
            "narration": {
              "en": "With a unified cry, the Swedish line surges ahead, bayonets gleaming in the late-afternoon haze."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Hurraaah!",
                  "person": "Swedish Soldiers"
                }
              }
            ]
          },
          {
            "id": "11.1.3",
            "description": {
              "en": "Russian infantry line buckling under pressure as an officer gestures urgently through drifting smoke."
            },
            "narration": {
              "en": "The Russian line wavers in the golden haze, soldiers stumbling as an officer fights to steady the collapsing front."
            },
            "dialogs": []
          },
          {
            "id": "11.1.4",
            "description": {
              "en": "A torn Russian banner fades into thick orange-lit smoke as the retreat begins."
            },
            "narration": {
              "en": "The tattered Russian banner slips into the billowing smoke, its colors dissolving as the retreat takes hold."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "12.1.1",
            "description": {
              "en": "Döbeln walks across a dusk-lit battlefield among fallen soldiers and abandoned gear."
            },
            "narration": {
              "en": "As dusk settles over the quiet field, Döbeln walks slowly among the fallen, smoke drifting low across the ground."
            },
            "dialogs": []
          },
          {
            "id": "12.1.2",
            "description": {
              "en": "Field surgeons treat wounded soldiers by dim campfire while Swedish officers confer in the dusk smoke."
            },
            "narration": {
              "en": "By the glow of low campfires, surgeons bend over the wounded as nearby officers speak in hushed tones beneath the drifting evening smoke."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "13.1.1",
            "description": {
              "en": "Wide modern scene of the Jutas monument exactly as in the provided reference, five meters tall, with a teacher resembling the provided photo and students gathered beneath it among birch trees."
            },
            "narration": {
              "en": "A teacher stands before the towering granite Jutas monument, guiding his students through the echoes of 1808 in the bright summer light."
            },
            "dialogs": []
          }
        ]
      }
    ],
    "styles": [
      "AN"
    ]
  }
]