[
  {
    "slug": "slaget-vid-jutas",
    "pages": [
      {
        "layout": "1",
        "panels": [
          {
            "id": "1.1.1",
            "description": {
              "en": "Full-page historical map of Finland during the 1808 war, drawn in clean anime-style lines and based on the attached reference."
            },
            "narration": {
              "en": "The war ignites across Finland as Swedish and Russian forces maneuver for control, each preparing for the decisive struggles ahead."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "2.1.1",
            "description": {
              "en": "Portrait-style confrontation of Georg Carl von Döbeln and Russian commander Nikolaj Kamenskij, with the two armies forming distant background masses."
            },
            "narration": {
              "en": "Two armies, backed by rival empires, ready themselves for the clash at Jutas, where decisions made by their commanders will shape the fate of the campaign."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "3.1.1",
            "description": {
              "en": "Panoramic late-summer view of Nykarleby with river bend, church steeple, wooden houses, and a distant small marching Swedish column."
            },
            "narration": {
              "en": "Nykarleby stands calm for now, unaware that its quiet streets will soon witness the movements of armies and the burden of war."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "4.1.1",
            "description": {
              "en": "A weary Swedish column marches through muddy late-summer roads with wagons trailing and distant smoke drifting on the horizon."
            },
            "narration": {
              "en": "Driven back from Vasa, the weary Swedish column presses southward, holding discipline despite exhaustion and the shadow of Russian pursuit."
            },
            "dialogs": []
          },
          {
            "id": "4.1.2",
            "description": {
              "en": "Döbeln rides beside weary Swedish soldiers marching through muddy autumn fields as light rain falls."
            },
            "narration": {
              "en": "Döbeln forces himself to remain with the troops, masking his illness as he pushes his officers to maintain order through the worsening march."
            },
            "dialogs": [
              {
                "en": {
                  "text": "We keep moving. No hesitation.",
                  "person": "Döbeln"
                }
              }
            ]
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "5.1.1",
            "description": {
              "en": "Evening exterior of a modest wooden house in Nykarleby, with a warm candle-glow shining from one window."
            },
            "narration": {
              "en": "Inside Döbeln’s temporary quarters, the burden of command presses heavily as he fights both fever and the urgency of the coming battle."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Sir, the latest reports from the outposts have arrived.",
                  "person": "Aide"
                }
              }
            ]
          },
          {
            "id": "5.1.2",
            "description": {
              "en": "Aide-de-camp arranging maps and dispatches on a wooden table lit by warm candlelight."
            },
            "narration": {
              "en": "The staff gathers intelligence and maps, knowing that every decision Döbeln makes from this bed will determine the army’s survival."
            },
            "dialogs": []
          },
          {
            "id": "5.1.3",
            "description": {
              "en": "Döbeln sits half-upright in his sickbed, gesturing firmly toward an aide who stands beside a table in the dim candlelit room."
            },
            "narration": {
              "en": "Though weakened, Döbeln’s resolve hardens; the fate of Jutas will not be decided without his direction."
            },
            "dialogs": []
          },
          {
            "id": "5.1.4",
            "description": {
              "en": "Döbeln, pale and bandaged, points at a map in candlelit quarters while lying in bed."
            },
            "narration": {
              "en": "He dictates the movement of brigades with precise intent, shaping the battlefield from memory and instinct."
            },
            "dialogs": [
              {
                "en": {
                  "text": "They must hold the road - Jutas cannot be lost.",
                  "person": "Döbeln"
                }
              }
            ]
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "6.1.1",
            "description": {
              "en": "Wide establishing view of the Jutas landscape with the river and road under clear late-summer daylight, based on the reference image without its bottom border or text."
            },
            "narration": {
              "en": "The march toward Jutas unfolds under afternoon light as the Swedish force closes in on the ground where they must stand and fight."
            },
            "dialogs": []
          },
          {
            "id": "6.1.2",
            "description": {
              "en": "Döbeln salutes from horseback before cheering Swedish infantry in the afternoon light near Jutas."
            },
            "narration": {
              "en": "Rallying himself, Döbeln greets his men, inspiring confidence as officers prepare the defensive positions ahead."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Hurrah for Döbeln!",
                  "person": "Troops (shouting)"
                }
              },
              {
                "en": {
                  "text": "Steady now—Jutas will be our stand.",
                  "person": "Döbeln"
                }
              }
            ]
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "7.1.1",
            "description": {
              "en": "Swedish skirmishers fire from a fence line as thin white musket smoke drifts across the field."
            },
            "narration": {
              "en": "The first shots erupt as Swedish skirmishers delay the Russian approach, buying precious time for the main force to form."
            },
            "dialogs": []
          },
          {
            "id": "7.1.2",
            "description": {
              "en": "Swedish skirmishers fall back in pairs along a smoke-covered road after receiving the signal to withdraw."
            },
            "narration": {
              "en": "Orders ripple down the line as the forward troops fall back with discipline, refusing to break despite the pressure."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Pull back — pair by pair!",
                  "person": "Officer"
                }
              }
            ]
          },
          {
            "id": "7.1.3",
            "description": {
              "en": "Russian infantry vanguard pushes forward through gaps in the fence line with bayonets held low amid drifting smoke."
            },
            "narration": {
              "en": "The Russian vanguard surges ahead, confident that momentum is turning in their favor."
            },
            "dialogs": []
          },
          {
            "id": "7.1.4",
            "description": {
              "en": "Von Döbeln is seen at a distance through drifting smoke, raising his hand to steady the Swedish line."
            },
            "narration": {
              "en": "From afar, Döbeln steadies his troops with calm precision, the sight of him preventing panic along the line."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "8.1.1",
            "description": {
              "en": "Wide view of dense Russian infantry ranks advancing through drifting smoke and splintered fencing."
            },
            "narration": {
              "en": "Russian ranks press forward relentlessly, convinced that sheer weight will break the Swedish defense."
            },
            "dialogs": []
          },
          {
            "id": "8.1.2",
            "description": {
              "en": "Swedish defenders crouch behind a low ridge as musket impacts spatter earth around them through drifting smoke."
            },
            "narration": {
              "en": "But the Swedes brace themselves behind the ridge, prepared to endure the storm and answer with disciplined fire."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Hold until my mark!",
                  "person": "Swedish Officer"
                }
              }
            ]
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "9.1.1",
            "description": {
              "en": "Döbeln raises his sword from horseback to signal the attack, aides beside him relaying the command through drifting battlefield smoke."
            },
            "narration": {
              "en": "With a decisive gesture, Döbeln unleashes the moment he has prepared for: concentrated counterfire to halt the Russian advance."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Now—let them feel our answer!",
                  "person": "Döbeln"
                }
              }
            ]
          },
          {
            "id": "9.1.2",
            "description": {
              "en": "Swedish artillery battery fires in unison, cannons recoiling as bright muzzle flames erupt through drifting smoke."
            },
            "narration": {
              "en": "Swedish artillery roars in synchronized force, shaking the field as gunners work with fierce precision."
            },
            "dialogs": []
          },
          {
            "id": "9.1.3",
            "description": {
              "en": "Swedish infantry fires a coordinated volley, a bright line of muzzle flashes casting a rolling wall of smoke forward."
            },
            "narration": {
              "en": "Infantry volleys follow, rolling across the line in disciplined waves that force the attackers to recoil."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "10.1.1",
            "description": {
              "en": "Russian infantry returns fire in a dense line as officers gesture for the formation to widen through drifting battlefield smoke."
            },
            "narration": {
              "en": "The Russians widen their formation, firing back with desperate intensity to regain the initiative."
            },
            "dialogs": []
          },
          {
            "id": "10.1.2",
            "description": {
              "en": "Swedish infantry hastily reload behind thick smoke, ramrods flashing as they prepare their next volley."
            },
            "narration": {
              "en": "Swedish soldiers reload under constant danger, grit and training sustaining them through the chaos."
            },
            "dialogs": []
          },
          {
            "id": "10.1.3",
            "description": {
              "en": "Wounded soldiers lie between the lines as stretcher men crouch low through drifting smoke."
            },
            "narration": {
              "en": "Casualties mount between the lines as stretcher-bearers attempt rescues under relentless fire."
            },
            "dialogs": []
          },
          {
            "id": "10.1.4",
            "description": {
              "en": "Swedish artillery crew swabs and rams the cannon as sparks flicker from the vent amid drifting smoke."
            },
            "narration": {
              "en": "The artillery crews maintain their deadly rhythm, each blast shaping the outcome of the battle."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "11.1.1",
            "description": {
              "en": "Döbeln rallies the Swedish line from horseback, sword raised, as infantry and riders advance through glowing battlefield smoke."
            },
            "narration": {
              "en": "Sensing the enemy’s hesitation, Döbeln rallies his troops forward, turning defense into a decisive counterstroke."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Forward! Drive them back!",
                  "person": "Döbeln"
                }
              }
            ]
          },
          {
            "id": "11.1.2",
            "description": {
              "en": "Swedish infantry charge forward with bayonets leveled through golden smoke."
            },
            "narration": {
              "en": "With cries of determination, the Swedish line charges, overwhelming the shaken Russians."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Hurraaah!",
                  "person": "Swedish Soldiers"
                }
              }
            ]
          },
          {
            "id": "11.1.3",
            "description": {
              "en": "Russian infantry line buckling under pressure as an officer gestures urgently through drifting smoke."
            },
            "narration": {
              "en": "Russian units falter as officers attempt—vainly—to restore cohesion."
            },
            "dialogs": []
          },
          {
            "id": "11.1.4",
            "description": {
              "en": "A torn Russian banner fades into thick orange-lit smoke as the retreat begins."
            },
            "narration": {
              "en": "The retreat begins in earnest, marked by abandoned banners and the chaos of a broken line."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "12.1.1",
            "description": {
              "en": "Döbeln walks across a dusk-lit battlefield among fallen soldiers and abandoned gear."
            },
            "narration": {
              "en": "As dusk settles, Döbeln surveys the cost of victory, carrying the weight of every life lost under his command."
            },
            "dialogs": []
          },
          {
            "id": "12.1.2",
            "description": {
              "en": "Field surgeons treat wounded soldiers by dim campfire while Swedish officers confer in the dusk smoke."
            },
            "narration": {
              "en": "Surgeons labor through the evening, while officers quietly count the price of the hard-won stand at Jutas."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "13.1.1",
            "description": {
              "en": "Wide modern scene of the Jutas monument exactly as in the provided reference, five meters tall, with a teacher resembling the provided photo and students gathered beneath it among birch trees."
            },
            "narration": {
              "en": "Generations later, the memory of Jutas endures as new voices retell the courage and sacrifice that shaped Finland’s history."
            },
            "dialogs": [
              {
                "en": {
                  "text": "Here, Döbeln’s stand changed the course of the campaign.",
                  "person": "Teacher"
                }
              },
              {
                "en": {
                  "text": "It feels different hearing it here, where it happened.",
                  "person": "Student"
                }
              }
            ]
          }
        ]
      }
    ],
    "styles": [
      "AN"
    ]
  }
]