[
  {
    "slug": "slaget-vid-jutas",
    "pages": [
      {
        "layout": "1",
        "panels": [
          {
            "id": "1.1.1",
            "description": {
              "en": "Georg Carl von Döbeln stands in the left foreground, his black headband clearly visible, calm and resolute. Opposite him, a Russian commander faces him from the right, rigid and formal in dark green uniform with red facings. Behind each man, their armies wait across the open countryside under late-summer light.",
              "se": "Georg Carl von Döbeln står i förgrunden till vänster, med sitt svarta pannband tydligt synligt, lugn och beslutsam. Mittemot honom står en rysk befälhavare i förgrunden till höger, stel och formell i mörkgrön uniform med röda uppslag. Bakom dem väntar deras arméer utspridda över det öppna landskapet i sensommarens ljus."
            },
            "narration": {
              "en": "After months of retreat, the fate of western Finland will soon be decided.",
              "se": "Efter månader av reträtt står västra Finlands öde snart på spel."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "1",
        "panels": [
          {
            "id": "2.1.1",
            "description": {
              "en": "A calm panoramic view of Nykarleby with a winding river, wooden town buildings, and open fields under late-summer light.",
              "se": "En lugn panoramavy över Nykarleby med en slingrande å, träbebyggelse och öppna fält i sensommarljus."
            },
            "narration": {
              "en": "Nykarleby lies quiet in the late summer of 1808. The river bends slowly past the town, fields stand undisturbed, and no sign yet reveals that war is drawing near.",
              "se": "Nykarleby ligger stilla sensommaren 1808. Ån slingrar sig långsamt förbi staden, fälten är orörda, och ännu finns inga tecken på att kriget närmar sig."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "3.1.1",
            "description": {
              "en": "A long Swedish column withdraws along a muddy road. Infantry march in silence while wagons creak behind them.",
              "se": "En lång svensk kolonn drar sig tillbaka längs en lerig väg. Infanteriet marscherar i tystnad medan vagnarna knarrar bakom dem."
            },
            "narration": {
              "en": "After weeks of pressure, the Swedish army retreats south from Vasa—worn, but not yet broken.",
              "se": "Efter veckor av hårt tryck drar den svenska armén sig tillbaka söderut från Vasa – sliten, men ännu inte bruten."
            }
          },
          {
            "id": "3.1.2",
            "description": {
              "en": "Döbeln rides alongside the retreating column, his posture firm despite exhaustion. Horses and men move together over rain-darkened ground.",
              "se": "Döbeln rider längs den retirerande kolonnen, med fast hållning trots utmattningen. Hästar och män rör sig tillsammans över regnmörk mark."
            },
            "narration": {
              "en": "Beside his men, Döbeln maintains the discipline of the retreat, turning withdrawal into resolve.",
              "se": "Vid sina män upprätthåller Döbeln ordningen under reträtten och förvandlar tillbakagång till beslutsamhet."
            }
          }
        ]
      },
      {
        "layout": "4",
        "panels": [
          {
            "id": "4.1.1",
            "description": {
              "en": "Exterior view of Döbeln’s house in Nykarleby. A modest wooden house under calm late-summer light, the yard quiet and still.",
              "se": "Exteriör vy av Döbelns hus i Nykarleby. Ett anspråkslöst trähus i lugnt sensommarljus, gården stilla och tyst."
            },
            "narration": {
              "en": "In Nykarleby, far from the front line yet bound to it by fate, the commander is struck down by illness.",
              "se": "I Nykarleby, långt från frontlinjen men oskiljaktigt bunden till den, slås befälhavaren ned av sjukdom."
            }
          },
          {
            "id": "4.1.2",
            "description": {
              "en": "Interior of Döbeln’s quarters. Döbeln lies in bed, pale and weakened, a head wound visible beneath the black headband as soft daylight enters through a small window.",
              "se": "Interiör av Döbelns rum. Döbeln ligger i sängen, blek och försvagad, med en huvudskada synlig under det svarta pannbandet medan mjukt dagsljus faller in genom ett litet fönster."
            },
            "narration": {
              "en": "Fever and pain confine Döbeln to his bed, yet the weight of command does not leave him.",
              "se": "Feber och smärta binder Döbeln vid sängen, men befälets tyngd lämnar honom inte."
            }
          },
          {
            "id": "4.1.3",
            "description": {
              "en": "Inside a modest wooden house in Nykarleby, a Swedish aide stands bent over a rough table, studying a hand-drawn military map. His finger traces the roads and rivers with focused precision as soft daylight falls across the room.",
              "se": "Inne i ett anspråkslöst trähus i Nykarleby står en svensk adjutant böjd över ett grovt träbord och studerar en handritad militärkarta. Med koncentrerad noggrannhet följer hans finger vägar och vattendrag medan mjukt dagsljus faller in i rummet."
            },
            "narration": {
              "en": "Even as Döbeln lies ill, the machinery of command continues its quiet work.",
              "se": "Även medan Döbeln ligger sjuk fortsätter befälets maskineri sitt stillsamma arbete."
            },
            "dialogs": []
          },
          {
            "id": "4.1.4",
            "description": {
              "en": "Döbeln, still weakened, sits upright and issues orders over a map while aides stand close and listen attentively.",
              "se": "Döbeln, fortfarande försvagad, sitter upprätt och ger order över en karta medan adjutanter står nära och lyssnar uppmärksamt."
            },
            "narration": {
              "en": "Illness halts his body, but not his command.",
              "se": "Sjukdomen hejdar hans kropp, men inte hans befäl."
            }
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "5.1.1",
            "description": {
              "en": "A calm, expansive view of the road toward Jutas. A winding dirt road leads through open fields toward a broad river bend in the distance, with wooden fences following the terrain and patches of forest framing the landscape under soft late-summer skies.",
              "se": "En lugn och vidsträckt vy över vägen mot Jutas. En slingrande landsväg löper genom öppna fält mot en bred älvkrök i fjärran, med gärdsgårdar som följer terrängen och skogsdungar som ramar in landskapet under mjukt sensommarljus."
            },
            "narration": {
              "en": "The road ahead opens toward Jutas.",
              "se": "Vägen framåt öppnar sig mot Jutas."
            }
          },
          {
            "id": "5.1.2",
            "description": {
              "en": "Georg Carl von Döbeln rides forward on horseback, saluting his soldiers as they line the road to Jutas. Swedish infantry of the Björneborgs regemente stand in formation with bayonets raised, cheering as morale visibly rises.",
              "se": "Georg Carl von Döbeln rider fram till häst och hälsar sina soldater längs vägen mot Jutas. Svenska infanterister ur Björneborgs regemente står uppställda med höjda bajonetter och jublar när moralen tydligt stärks."
            },
            "narration": {
              "en": "Döbeln’s return to the saddle spreads renewed confidence through the ranks.",
              "se": "Döbelns återkomst till sadeln sprider förnyat mod genom leden."
            },
            "dialogs": []
          }
        ]
      },
      {
        "layout": "3",
        "panels": [
          {
            "id": "6.1.1",
            "description": {
              "en": "Two Swedish infantry soldiers from Björneborgs läns infanteriregemente crouch behind low natural cover at the outskirts of Jutas. One soldier aims a flintlock musket forward with calm focus, while the second stays close beside him, alert and ready. The air is clear with no weapons smoke, and the surrounding late-summer landscape is quiet and tense, marking the very first controlled moments of the battle.",
              "se": "Två svenska infanterisoldater ur Björneborgs läns infanteriregemente hukar bakom lågt naturligt skydd i utkanten av Jutas. Den ene soldaten siktar framåt med sin flintlåsmusköt med lugn koncentration, medan den andre håller sig tätt intill, vaksam och redo. Luften är klar utan krutrök, och det sena sommarlandskapet är stilla och spänt – stridens allra första, kontrollerade ögonblick."
            },
            "narration": {
              "en": "The first shots are taken—measured, deliberate, and without yet plunging the field into chaos.",
              "se": "De första skotten avlossas – avvägda och kontrollerade, innan slagfältet ännu kastas in i kaos."
            },
            "dialogs": []
          },
          {
            "id": "6.1.2",
            "description": {
              "en": "Russian infantry vanguard advances cautiously through low wooden fences and dense brush on the outskirts of Jutas. The foremost soldier moves carefully with musket in hand while his backpack carries only standard gear and a rolled greatcoat — no spare weapon attached. Other soldiers follow in loose formation, partially obscured by foliage and light gun smoke, their posture tense and alert as the battle begins.",
              "se": "Den ryska infanteriförtruppen avancerar försiktigt genom låga trästängsel och tät sly i Jutas utkanter. Den främste soldaten rör sig varsamt med musköten i händerna, medan ryggsäcken endast bär standardutrustning och en rullad rock — inget extra vapen är fäst. Övriga soldater följer i lös formation, delvis skymda av vegetation och lätt krutrök, med spända och vaksamma kroppshållningar när striden tar sin början."
            },
            "narration": {
              "en": "From the tree line, the Russian advance presses forward, testing the ground and the enemy’s resolve.",
              "se": "Från skogsbrynet pressar den ryska framryckningen vidare, prövar marken och fiendens beslutsamhet."
            }
          }
        ]
      },
      {
        "layout": "2",
        "panels": [
          {
            "id": "7.1.1",
            "description": {
              "en": "Swedish infantry of the Björneborgs regemente fires a disciplined volley through thick gunpowder smoke. The firing line holds steady under command, muskets discharging in near-unison amid the chaos of battle.",
              "se": "Svenskt infanteri ur Björneborgs regemente avfyrar en disciplinerad salva genom tät krutrök. Eldlinjen står fast under befäl, musköterna brinner av nästan samtidigt mitt i stridens kaos."
            },
            "narration": {
              "en": "At Jutas, discipline answers chaos. The Swedish line fires as one.",
              "se": "Vid Jutas möter disciplinen kaoset. Den svenska linjen avfyrar som en enda kropp."
            }
          },
          {
            "id": "7.1.2",
            "description": {
              "en": "Russian infantry advances across the Jutas battlefield with bayonets fixed, moving through drifting smoke and trampled ground. The formation presses forward with determination under heavy fire.",
              "se": "Ryskt infanteri rycker fram över slagfältet vid Jutas med fästa bajonetter, genom drivande krutrök och upptrampad mark. Formationerna pressar framåt med beslutsamhet under hård eld."
            },
            "narration": {
              "en": "The Russian line pushes onward, seeking to break the Swedish defense through sheer momentum.",
              "se": "Den ryska linjen pressar vidare, i hopp om att bryta det svenska försvaret genom ren kraft och rörelse."
            }
          }
        ]
      }
    ],
    "styles": [
      "AN"
    ]
  }
]